app/controllers/wikis_controller.rb

  def index
    @wikis = Wiki.visible_to(current_user).paginate(page: params[:page], per_page:10)
---
SELECT "wikis".* FROM "wikis"

  def show
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @wiki = Wiki.new(params.require(:wiki).permit(:title, :body))
    @wiki.user = current_user
    authorize @wiki

    if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Fourth test Wiki"], ["body", "This is the 4th test Wiki."], ["user_id", 5], ["created_at", "2015-10-14 22:06:41.438171"], ["updated_at", "2015-10-14 22:06:41.438171"]]

  def edit
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 11]]

  def update
    @wiki = Wiki.find(params[:id])
    if @wiki.update_attributes(params.require(:wiki).permit(:title, :body))
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "wikis" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "Snakes are so cool!"], ["body", "North American snakes have many varieties and are just cool!"], ["updated_at", "2015-10-13 17:46:21.305261"], ["id", 11]]

  def destroy
    @wiki = Wiki.find(params[:id])


    if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 11]]